'''Найдите сумму цифр трехзначного числа. '''

print ('Введите трехзначное число: ')
x = input()
a = int (x[0]) + int (x[1]) + int (x[2]) 
print (f'Сумма цифр трехзначного числа = {a}')